tsung_signin_post_claim_rate.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="www.locamotor-load.pyaxtkrft7.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- Create random -->
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rndint" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rndintTwo" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="13">
        <var name="rndname" />
      </setdynvars>


      <!-- Sign in -->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <thinktime value="3" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url='/users/sign_in' method='POST' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=user%%_rndint%%%40gmail.com&amp;user[password]=1234567&amp;user[remember_me]=0" content_type="application/x-www-form-urlencoded"> </http>
      </request>


      <!-- Create post -->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/posts/new' version='1.1' method='GET'></http>
      </request>

      <thinktime value="3" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name="post_id" re="PostID: (.*)\r"/>
        <http url='/posts' method='POST' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;post[email]=user%%_rndint%%%40gmail.com&amp;post[post_type]=Renting%20out&amp;post[vehicle]=Boat&amp;post[start_time]=2016-01-01T12%3A00%3A00&amp;post[end_time]=2016-06-06T18%3A06&amp;post[dollar_amount]=5&amp;post[location]=Goleta%2C%20CA&amp;post[description]=tsung%20here%20%%_rndname%%&amp;auto_book=auto_book&amp;post[max_radius]=100" content_type="application/x-www-form-urlencoded"> </http>
      </request>

      <!-- Sign out -->
      <request subst="true">
        <http url='/users/sign_out' method='GET' version='1.1' contents="authenticity_token=%%_authenticity_token%%" content_type="application/x-www-form-urlencoded"> </http>
      </request>


      <!-- Second client sign in -->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <thinktime value="3" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url='/users/sign_in' method='POST' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=user%%_rndintTwo%%%40gmail.com&amp;user[password]=1234567&amp;user[remember_me]=0" content_type="application/x-www-form-urlencoded"> </http>
      </request>      

      <!-- Claim post -->
      <request subst="true">
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/posts/%%_post_id%%' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url='/posts/%%_post_id%%/claim' method='PATCH' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;name=billy&amp;reservation[start_time]=2016-01-01T12%3A00%3A00&amp;reservation[end_time]=2016-06-06T18%3A06&amp;confirmed=auto_book&amp;commit=Book Now" content_type="application/x-www-form-urlencoded"> </http>
      </request>
    </session>
  </sessions>

</tsung>